# Даны 2 действительных числа a и b. Получить их сумму, разность и произведение

a = float(input())
b = float(input())
summa = a + b
residual = a - b
composition = a * b
print(f'Сумма чисел {a} и {b} равна {summa}')
print(f'Разность чисел {a} и {b} равна {residual}')
print(f'Произведение чисел {a} и {b} равно {composition}')
