# Даны 2 действительных числа a и b. Получить их сумму, разность и произведение
a = float(input("Введите число a: "))
b = float(input("Введите число b: "))

print("Сумма чисел: ", a+b)
print("Разность чисел a-b: ", a-b)
print("Разность чисел b-a: ", b-a)
print("Произведение чисел: ", a*b)
