# Даны действительные числа x и y. Получить x − y / 1 + xy
x = float(input("Введите число x: "))
y = float(input("Введите число y: "))

print("Получилось: ", x-y/1+x*y)
