# Даны два действительных числа. Найти среднее арифметическое и среднее геометрическое этих чисел
x = float(input("Введите число x: "))
y = float(input("Введите число y: "))

print("Среднее Арифметическое: ", (x + y) / 2)
print("Среднее Геометрическое: ", (x * y) ** 0.5)
